{"version": "https://jsonfeed.org/version/1.1",
"title": "blog.bott.im",
"home_page_url": "https://blog.bott.im/",
"feed_url": "https://blog.bott.im/full.json",
"description": "Personal Opinions, Tech Projects and Open Source in General",
"user_comment": "blog.bott.im JSON feed (full articles)",
"authors": [
  {
    "name": "Rudolph Bott",
    "url": "https://blog.bott.im/"
  }
],
"language": "en",
"icon" : "https://blog.bott.im/icon-192.png",
"favicon" : "https://blog.bott.im/icon-512.png","items": [{"id": "https://blog.bott.im/introduction-to-ganeti/",
"url": "https://blog.bott.im/introduction-to-ganeti/",
"title": "Introduction to Ganeti",
"date_published": "2024-01-01T00:00:00Z",
"language": "","content_html": "&lt;p&gt;&lt;b&gt;Disclaimer:&lt;/b&gt; Being one of the maintainers of the Ganeti project, some views might be biased here :-)&lt;/p&gt;&lt;p&gt;During the next weeks and months I will publish a series of blog posts about &lt;a href=&quot;https://ganeti.org/&quot;&gt;Ganeti&lt;/a&gt;. It is a virtual machine cluster management solution which started as an internal project at Google and saw its first public release in August 2007. With the beta release of Ganeti 3.0 in June 2020, development has officially been taken over by the Ganeti Community from Google.&lt;/p&gt;
&lt;h2 id=&quot;but-what-does-it-actually-do&quot;&gt;But what does it actually do?&lt;/h2&gt;
&lt;p&gt;Ganeti can be used on a single system to spawn local VMs using KVM or Xen (think of an alternative to libvirt). However, its strength is running in clustered environments, operating dozens or even hundreds of VMs across many physical nodes.&lt;/p&gt;
&lt;p&gt;To achieve this, Ganeti builds upon existing solutions. VM Storage can be local or replicated (using DRBD, Ceph, Gluster or custom solutions), VM connectivity can be implemented using linux bridges, Open vSwitch or in a routed fashion. Virtualisation builds upon KVM, Xen (both HVM and PVM) or LXC (which is still present in the codebase, but not maintained as of now). Communication between physical nodes is handled through SSH and HTTP APIs.
The primary way of managing/interacting with Ganeti are versatile CLI commands, but there is also a REST API available for integration into existing automation solutions.&lt;/p&gt;
&lt;h2 id=&quot;does-it-do-high-availability&quot;&gt;Does it do High Availability?&lt;/h2&gt;
&lt;p&gt;That’s a definitive maybe. First of all, you need to select a storage backend that supports replication of some sorts. Currently that would be either DRBD, RBD (Ceph) or GlusterFS. Ganeti also supports a file based approach where Ganeti assumes that replication of these files is handled outside of Ganeti (e.g. a shared NFS mount). With either of these storage backends in place you can live migrate VMs between nodes and also start them on another node if the formerly primary node unexpectedly dies. While Ganeti will restart a crashed VM (through a periodically running maintenance process) on its original node, it will not automatically switch a VM to a backup node. This must be done manually by a human. You can use the tool harep that ships with Ganeti for a more automated approach, but I have never used that so far.&lt;/p&gt;
&lt;p&gt;For all scenarios I have encountered it was enough to manually start VMs on other nodes after a failure because there was additional redundancy on the VM level (e.g. multiple backends together with HA loadbalancers using VRRP,  anycast etc.). Hence, “eventual availability” was more than suitable.&lt;/p&gt;
&lt;h2 id=&quot;resource-allocation&quot;&gt;Resource Allocation&lt;/h2&gt;
&lt;p&gt;While you can allocate VMs manually across your cluster nodes, Ganeti can and should do that automatically for you. This will ensure that your cluster always maintains a N+1 state where one node may fail at any time and the remaining nodes have enough spare resources to host the additional workload. You can also tag your VMs so that multiple instances of the same application do not end up on the same physical node.
Cluster/Node Maintenance
Using the CLI or the API you can easily drain a node and (live) migrate all running instances to other nodes or rebalance the entire cluster after maintenance work. There is also tooling available that helps you plan maintenance of nodes.&lt;/p&gt;
&lt;h2 id=&quot;os-providers&quot;&gt;OS Providers&lt;/h2&gt;
&lt;p&gt;How to set up new VMs, you may ask? Ganeti has a concept of so called OS providers. Most widely used is probably the deboostrap OS provider (also available as a package on Debian) which creates Debian or Ubuntu installations using the debootstrap tool and custom hooks. There are also many community providers available which make use of e.g. prebuilt images. You may also use the so-called “no-op OS provider” (also available as Debian package) which tells Ganeti to leave your VM alone and you can e.g. boot/install via ISO image or PXE boot.&lt;/p&gt;
&lt;h2 id=&quot;what-does-ganeti-suck-at&quot;&gt;What does Ganeti suck at?&lt;/h2&gt;
&lt;p&gt;As of the time of writing, KVM VMs are stuck with the rather old &lt;code&gt;pc&lt;/code&gt; machine type and also do not support UEFI booting. This will sooner or later impose problems with Windows guest systems. There is also no official upstream GUI/web interface available (however, there are third party options). The official documentation works but looks a bit dated,has a sometimes confusing structure and is missing easy-to-follow getting-started documentation (although there is work in that direction on the way). OTOH the man pages are a very good source of information. While the larger part of the codebase is written in Python (which is easy to read and understand) there are also Haskell parts, which are not that accessible to the broader public (could be rephrased to: I suck at Haskell).&lt;/p&gt;
&lt;h2 id=&quot;why-should-i-use-ganeti&quot;&gt;Why should I use Ganeti?&lt;/h2&gt;
&lt;p&gt;There are packages available for Debian, Ubuntu, GNU Guix and also RPM-based distributions. Especially the official Debian packages are well maintained and it is very easy to set up an entire cluster with many nodes without using any third party repositories/software. However, this will be covered in a different blog post 🙂
Upgrades of Ganeti clusters are possible and usually work flawlessly. Ganeti itself does not get in the way of your VM operations. It is very robust and can recover from many error states by itself.
While RBD/Ceph or Gluster backends require the additional installation/configuration of services outside of Ganeti, DRBD is fully managed. Ganeti will take care of all DRBD-related operations and provide you with redundant VMs at no additional operative cost. Ganeti powers well-known infrastructures like Wikimedia, Tor Project, Debian or ICANN. It is also in use at various universities and many private companies and you can interact with developers and the community using mailing lists, IRC or Github issues.&lt;/p&gt;
"
    }]
}